# DoubleParameterValue Constructor (Double)

---
C#Visual BasicVisual C++
Revit 2024 API
---
DoubleParameterValue Constructor (Double)
DoubleParameterValue Class See Also
---
Value constructor
**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)**Since:** 2016 Subscription Update
# Syntax
C#
---
```text
public DoubleParameterValue(
	double value
)
```

Visual Basic
---
```text
Public Sub New ( _
	value As Double _
)
```

Visual C++
---
```text
public:
DoubleParameterValue(
	double value
)
```

# ### Parameters
value
    Type: System..::..Double
# See Also
DoubleParameterValue Class
DoubleParameterValue Overload
Autodesk.Revit.DB Namespace